{
    "ru": "<p>Я Дизайнер и Full-Stack разработчик из Санкт-Петербурга. Разрабатываю интерфейсы с 2015 года. </p><p>Имею опыт разработки и поддержки нескольких больших сложных веб приложений на Vue.js + Node.js. Разрабатывал как фронтенд, так и бэкенд. Понимаю принципы построения гибкой, расширяемой архитектуры приложения. Самостоятелен в решении трудностей, и изучения нового, имею опыт разработки и продвижения собственного онлайн проекта с лентой, чатами, интерактивными картами и интеграцией сайта с мобильным приложением.</p><p>Frontend: Vue.js, Webpack, Stylus, SCSS, Less, ESLint, Socket.io, REST API, нативный JS, Bootstrap, DevExtreme, знаю как разрабатывать быстрый фронт, имею большой опыт разработки дашбордов, работы с картами Open Layers, MapBox, Leaflet, работал с облаками точек 3D в Potree.js и Tree.js. Создавал сложный интерфейс с множеством окон, 2D и 3D сцен. Адаптировал SPA для поисковых роботов.</p><p>Верстка: Хорошо верстаю сложные адаптивные макеты, использую БЭМ методологию наименования классов, pixel perfect. Собираю проекты на Gulp, Webpack + Pug + Stylus/Sass. Владею чистым JavaScript, jQuery, понимаю и использую EcmaScript 6.</p><p>General: Git, Git Flow, NPM, Nginx, Docker, Docker-compose, TypeScript, стараюсь придерживаться принципов SOLID DRY YAGNI KISS.</p><p>Backend: Node.js, Express.js, Sequelize.js, MySQL, Socket.io, MemCached, JWT, Social Auth, NodeMailer, Sharp.js для загрузки и оптимизации изображений.</p><p>Playable Ads: Имею опыт разработки Playable Ads приложений (игровая реклама). Создавал креативы для Яндекс, Forex, Ask.fm, iFunny, PokerUp, IUGO.</p>",
    "en": "<p>I am a Designer and Full-Stack developer from Saint Petersburg. I have been developing interfaces since 2015.</p><p>I have experience in developing and supporting several large complex web applications on Vue.js + Node.js. I have developed both frontend and backend. I understand the principles of building a flexible, extensible application architecture. I am independent in solving difficulties and learning new things, I have experience in developing and promoting my own online project with a feed, chats, interactive maps and integrating a site with a mobile application.</p><p>Frontend: Vue.js, Webpack, Stylus, SCSS, Less, ESLint, Socket.io, REST API, native JS, Bootstrap, DevExtreme, I know how to develop a fast frontend, I have extensive experience in developing dashboards, working with Open Layers maps, MapBox, Leaflet, worked with 3D point clouds in Potree.js and Tree.js. I created a complex interface with multiple windows, 2D and 3D scenes. Adapted SPA for search robots.</p><p>Layout: I am good at laying out complex adaptive layouts, use the BEM methodology for naming classes, pixel perfect. I build projects on Gulp, Webpack + Pug + Stylus/Sass. I know pure JavaScript, jQuery, understand and use EcmaScript 6.</p><p>General: Git, Git Flow, NPM, Nginx, Docker, Docker-compose, TypeScript, I try to adhere to the principles of SOLID DRY YAGNI KISS.</p><p>Backend: Node.js, Express.js, Sequelize.js, MySQL, Socket.io, MemCached, JWT, Social Auth, NodeMailer, Sharp.js for loading and optimizing images.</p><p>Playable Ads: I have experience developing Playable Ads applications (game advertising). Created creatives for Yandex, Forex, Ask.fm, iFunny, PokerUp, IUGO.</p>"
}